'''Задача 2. Изучение текста отчёта компании.
Квартальный отчёт IT-фермеров "Килобайты урожая" о сельскохозяйственных работах содержит текстовую часть.

Пример исходных данных (текстовая часть отчёта, формат файла txt):
В целом, урожай был хороший. Сбор пшеницы начался рано. Урожай и сбор ячменя прошёл на отлично.
Сельхозтехника ломалась мало, поэтому простоев оборудования не было.
[см. рис. 2: распределение урожай по регионам]

Задание:
Напишите функцию, которая загружает текст из файла data.txt, подсчитывает частоту слов, игнорируя стоп-слова, и учитывает синонимы: "урожай" и "сбор" считаются одним словом. Выведите списком в порядке возрастания частоты встречаемости трёх самых частых слов с учётом синонимов.

Стоп-слова:
stop_words = {"и", "был", "проходит", "хороший", "продолжается", "начался", "завершён", "превысил", "средний", "успешным"}

Синонимы:
synonyms = {"сбор": "урожай"}

Пример выходных данных:
[('урожай', 11), ('кукуруза', 12), ('отличный', 13)]

Замечания:

Однокоренные слова - это разные слова. Например, пшеница и пшеницы - два разных слова.
Первым шагом надо найти все слова, убрать цифры, пунктуацию и привести к нижнему регистру. Для этого использовать регулярные выражения.
В исходном тексте есть выражения в квадратных скобках. Их учитывать не надо.
Формат ввода
Файл формата txt: data.txt

Формат вывода
Список. Пример вывода есть в условии задачи.'''



def yandex_govno():
    with open('data.txt', encoding='utf-8') as f:
        text = f.read()

    while '[' in text and ']' in text:
        start = text.find('[')
        end = text.find(']', start)
        text = text[:start] + text[end + 1:]

    words = []
    current = ''
    for char in text.lower():
        if 'а' <= char <= 'я' or char == 'ё':
            current += char
        elif current:
            words.append(current)
            current = ''
    if current:
        words.append(current)

    stop_words = {"и", "был", "проходит", "хороший", "продолжается",
                  "начался", "завершён", "превысил", "средний", "успешным"}

    synonyms = {"сбор": "урожай"}

    count_dict = {}
    for i in words:
        if i in stop_words:
            continue
        if i in synonyms:
            i = synonyms[i]
        count_dict[i] = count_dict.get(i, 0) + 1

    result = sorted(count_dict.items(), key=lambda x: x[1])[-3:]
    return result

print(yandex_govno())





























